{
	"title": "2 years in Ireland",
	"date": "2018",
	"displayDate": "2016-2018",
	"translations": {
		"français": "2-ans-en-irlande"
	},
	"visible": true,
	"tags": ["studies", "ireland", "school"],
	"content": "<p class=\"my-4\">These 2 years were pretty inetresting and taught me a lot, I might ramble a bit on this one.</p>  <p class=\"my-4\">Let's start by talking about some things I liked about my stay in Ireland. I know it might sound weird but I really like the weather actually, it's rarely too hot or too cold to casually go outside and the frequent rain is often just an easy to ignore drizzle. When I was there the country got hit with both a \"snow storm\" and a regular \"storm\". I put them between quotes because they turned out to be slightly above average weather conditions for where I lived all my life in the mountains. I'm not sure what that says about either place but the snow storm was really enjoyable to stroll through listening to podcasts.</p>  <p class=\"my-4\">Some time in the middle of 2016 the family that hosted me (I had a bedroom in their house) offered me to move into their former workshop, now transformed into a 1 person appartment. Even though it was connected to the house, for all intents and purposes I lived alone in there and it was amazing! There's nothing quite like living alone for the first time.</p>  <p class=\"my-4\">It was really interesting to see cultural differences as well, most of them minute. Even the people looked slightly different than where I was from (and I must say I like the look of Irish women a bit more). But all in all Dublin and its suburbs can still be described by \"a European city with a higher concentration of bars\" with 95% accuracy.</p>  <p class=\"my-4\">There are however things that I enjoyed much less in Eire. First of all the houses around where I lived were terrible on pretty much every metric I can think of. Poorly insulated, ugly, plain and boring, badly kept mostly and most of their windows open directly onto the street meaning that you can't really ever open the curatins. Everything is pretty expensive (especially alcohol) but that comes with being on an island mostly composed of grass and sheep I guess.</p>  <p class=\"my-4\">A more subtle gripe is that the entire country seems permeated by a serious lack of interest in any country wide or even city wide improvment, as if everything \"will be grand\" in the end. But it wont, if you don't keep governments and companies honest they encroach on your liberties in a neverending quest for power and money. I must admit that French people might be taking the concept a bit too far with constant striking and a strong instinct to say \"no\" even before hearing the arguments but the Irish population clearly doesn't stand up for themselves enough and it can be seen in a multitude of way. For instance the traffic in Dublin is <em>always</em> terrible and their bus/tram system is woefully inadequate for a capital but nothing changes because \"it'll be grand\"...</p>  <p class=\"my-4\">I could also say many disparaging things about the university I studied at (Institute of Technology Tallagh) but all in all I learned a ton of stuff about computing and programming during these 2 years. Most of the learning wasn't done in the school but the end result is the same.</p>  <p class=\"my-4\">Every other saturday for the entire time I volonteered to teach a beginner JavaScript class to kids as part of <a href=\"https://coderdojo.com/\" target=\"_blank\" class=\"a\">CoderDojo</a> and I started to discover that <a href=\"blog/i-like-teaching\" class=\"a\">I really enjoy teaching kids</a>.</p>  <p class=\"my-4\">I'm not sure who I'm writing this for but if you're reading this you know broadly what I think of Ireland (mostly the Dublin area though, the rest of the country is really beautiful and less densely populated).</p>  <p class=\"my-4\">I do miss fish and chips very much though.</p>"
}
