{
	"title": "Flashcards",
	"date": "2019-06-09",
	"displayDate": "June 2019",
	"visible": true,
	"tags": ["dev", "project", "sapper", "tool", "sharing", "abandonned"],
	"content": "<p class=\"my-4\">I'm a firm believer that <a href=\"https://en.wikipedia.org/wiki/Flashcard\" target=\"_blank\" class=\"a\">Flashcards</a> are one of the best wrote memorization tool available to humans when combined with regular practice. I however do not believe that humans should be required to learn things by heart, that's the computer's job. My memory is faillible, a computer's is not; my memory degrades rapidly when not used, a computer's does not. I have more arguments against using your brain for pretty much anything other than problem solving but they are part of another blog post. Unfortunately, not everybody sees things that way therefore some people need systems to help memorize things so I tried my hand at making a <a href=\"https://terry.gonguet.com/flashme\" target=\"_blank\" class=\"a\">simple flashcard app</a>.</p><p class=\"my-4\">It has 3 main features: styling, ranking and sharing.</p><p class=\"my-4\">Every card can display arbitrarily styled text via a wysiwig widget on the editor page and optionally a picture (that can be taken directly from the app if your device has a camera!). This simple structure allows a lot of customization to fit most needs.</p><p class=\"my-4\">When you answer a card correctly some invisible counter increases and you'll see it slightly less often and <em>vice versa</em> if you get it wrong. This simple concept makes it so that you'll see most often the concepts you have the most trouble with and least often (though not never) the things you already know by heart. When you've mastered all the cards in a collection they'll all be as likely to appear and you can come back to keep it fresh in your mind.</p><p class=\"my-4\">Lastly, you can share a collection you've created with other people via a simple link. For simplicity's sake only the owner of a collection can modify it and everyone else will simply see the updated version. If I ever come back to this project to make it a \"real\" product I will set up real collaboration tools but it wasn't worth it for a prototype.</p><p class=\"my-4\">I used my favorite framework <a href=\"https://sapper.svelte.dev/\" target=\"_blank\" class=\"a\">Sapper</a> to make the development job a breeze. The whole app is just static HTML/CSS/JS because all the data is stored locally on the client. There wasn't any real challenge in making this app thanks to the power of Sapper and Svelte, I just had a friend tell me his girlfriend would need something like this, whipped up a prototype and stopped when none of the two people it was for showed any interest in trying to use it.</p>"
}
