{
	"title": "Project Hestia",
	"date": "2018-06-17",
	"displayDate": "June 2018 till now",
	"visible": true,
	"tags": ["development", "cv", "newtab", "vue", "project"],
	"content": "<p class=\"my-4\">The more time you spend using a web browser the more important your \"new tab\" page becomes. It might be fine for your technologically reticent relatives to have the default page or even a blank page pop up on a new tab but as this action becomes more frequent you might find yourself wanting more from the default layout. Many people never feel this need and are entirely satisfied with whatever links Chrome thinks you want to see but as you might expect from me if you ever read anything else on this site, I'm almost never satisfied with defaults.</p><p class=\"my-4\">Unsurprisingly enough there are entire communities that formed around this idea of customizing your new tab page. Most just want to make it look nicer and show more personality than a eye blazing white page and maybe put some links to websites they visit frequently. I really like the threads that sometimes pop up on <a href=\"https://boards.4chan.org/wg/\" target=\"_blank\" class=\"a\">/wg/</a> because their new tabs end up looking (predictably) very good. From what I can see most people \"just\" set up a static HTML document that they have to edit manually to update. That's not my style.</p><p class=\"my-4\">So I did what every sane person would do in my position and made <a href=\"https://addons.mozilla.org/en-US/firefox/addon/living-room-tab/\" target=\"_blank\" class=\"a\">a web extension</a> that pretty much only my little brother and I use. It is not available right now because of technical difficulties with AMO policies that I haven't had time to fix yet. Here is a screenshot of what it looks like for me on my developer session.</p><picture>  <source srcset=\"img/sm/hestia.webp 801w, img/md/hestia.webp\" type=\"image/webp\" />  <source srcset=\"img/sm/hestia.jpg 801w\" type=\"image/jpg\" />  <source srcset=\"img/md/hestia.png\" type=\"image/png\" />  <img class=\"m-auto\" src=\"img/md/hestia.png\" alt=\"My new tab page\" /></picture><p class=\"my-4\">Every section is 100% editable, you can set width, height, title, icon, position and edit all the links and their shorcuts as well. You can of course change all the colors and the number of columns and rows of the master grid. You can also set the big title at the top to display either the date or a randomly chosen phrase from a customizable list. There are also other types of widgets like the text area, the clock, the tab counter or quote of the day, all customizable of course.</p><p class=\"my-4\">This is probably overkill for most people that aren't me but as I go and slowly add features to it I do more and more things with it. The next things to add are checklists and image caroussels. I also really like that I can change this page's colors to match my browser theme and make it look like it really belongs. My \"default\" session has a much <em>much</em> more crowded grid and it holds up pretty well if I say so myself.</p><p class=\"my-4\">All in all I'm very proud of this and because I'm pretty much the only real user I can make it do <em>exactly</em> what I need at the cost of a few hours. The interface is powered by <a href=\"https://vuejs.org/\" target=\"_blank\" class=\"a\">VueJS</a>, persists all of its data in the extension's storage and manages it with <a href=\"https://vuex.vuejs.org/\" target=\"_blank\" class=\"a\">VueX</a>.</p><p class=\"my-4\">The same way I recommend evryone who can to make their own website <a href=\"blog/i-made-a-website\" class=\"a\">like I did</a>, I also recommend that you make your own tools. Not everyone has the skills necessary but there are more ways to create tools than just software. If you haven't already, <a href=\"https://en.wikipedia.org/wiki/Getting_Things_Done\" target=\"_blank\" class=\"a\">Getting Things Done</a> is more than worth reading for a well thought out example.</p>"
}
