{
	"title": "I like teaching",
	"date": "2016 till now",
	"formatDate": false,
	"visible": true,
	"tags": ["teaching", "learning", "kids", "young", "helping"],
	"content": "<article class=\"text-justify\">  <p class=\"my-4\">The original title of this post was \"I like teaching kids\" but the longer I think about it the more I realise that I don't only like teaching to kids but to anyone willing to learn really. The first real experience I had with teaching was volonteering for <a href=\"https://coderdojo.com/\" target=\"_blank\" class=\"a\">CoderDojo</a> in the university in Ireland where I spent 2 hours every other saturday for the 2 years I was there teaching a beginner's JavaScript class to young kids. The organisation was sub-par and some kids were clearly too young but I learned a lot doing this.</p>  <p class=\"my-4\">Fast forward 2 years and I am now spending 4.5 hours per week helping kids from 14 to 18 (in relatively homogenous age groups) with their homeworks and classes. Some hours are paid, some are volonteering and it's the best work I've ever had and would love to do more (work as in \"calssic\" work, I still want to do programming for my carreer).</p>  <p class=\"my-4\">There is something incredibly rewarding about helping people wrap their heads around ideas that they didn't understand before, to instill that \"got it!\" moment. It sometimes feels like an puzzle where I don't know the exact shape of it but I have to keep trying to reformulate, draw, use examples or change approaches to help the ideas \"fit\" into place in someone's head.</p>  <p class=\"my-4\">Perhaps not unrelated is my life long passion for learning new things. I just love to learn anything about almost everything (sorry accounting but you're not for me...) and especially if it can help me in my work. The Internet makes satisfying my appetite for knowledge wonderfully easy and fun and it's one of the best things about the modern world in my opinion. It's sad to see that the newest generations sometimes don't seem to realise the treasures at their disposition...</p></article>"
}
