{
	"title": "I made a new website for myself",
	"date": "2020-02-14",
	"visible": true,
	"tags": ["first", "cv", "svelte", "project", "development"],
	"content": "<p class=\"my-4\">Every so often, I come across <a href=\"https://guzey.com/personal/why-have-a-blog/\" target=\"_blank\" class=\"a\">some content</a> or people praising the benefits of having your own blog. Being a developer as well I also get a lot of my information and entertainment from other people's blogs, be them software documentation, tech or general life advice, economics etc. This idea of having my own blog always floated in my head as one of those \"I should do that sometimes\" ideas. It took me years to make this here website because of the usual combination of \"I'm too busy right now\" and <a href=\"https://en.wikipedia.org/wiki/Impostor_syndrome\" target=\"_blank\" class=\"a\">ye olde impostor syndrome</a>.</p><p class=\"my-4\">I don't think I'm a good writer by any stretch of the imagination (my mother tongue being French doesn't help much as well) and I may be proud of my technical skills relative to my (pretty much non existant) experience but I am under no illusion that I have anything that useful to contribute to the world yet. However I do understand that to be good at something you have to do it <em>a lot</em>, so I am starting now with the aim of being at least passable when I do have something of value come out of my brain. I sometimes think that I could have written many of the blogs and tutorials that I see out there but I find it impossible to motivate myself to do something that has already been done better somewhere else. I know this is a flawed reasonning but I can't help losing all inspiration when I think about making <em>yet another</em> Vue tutorial or other.</p><p class=\"my-4\">So why make this website/blog myself and not with <a href=\"https://wordpress.com/\" target=\"_blank\" class=\"a\">one of those</a> <a href=\"https://www.squarespace.com/\" target=\"_blank\" class=\"a\">drag and drop</a> <a href=\"https://www.wix.com/\" target=\"_blank\" class=\"a\">site builders</a>? Power, freedom and pride. I have the skills to allow me to make this website from the ground up and that gives me the freedom and versatility to do virtually anything I want pretty quickly. I don't have to ask anybody, wait for anybody or pay anybody to change aything that tickles my fancy. It did take longer and took me more effort than if I used a site builder but I am much happier now that I know <em>everything</em> about this piece of software. For instance while writing this paragraph I realised that I could write a few lines of code that would make formatting <em>italics</em> and <strong>bold</strong> faster and now it's in my editor.</p><p class=\"my-4\">To be thorough I have to mention that I technically could have used Twitter, Tumbler or some other blue-themed amoeba trying to become <em>the</em> internet and sell your soul on your behalf. I remain convinced that almost all forms of social networks are a net negative for society (but that's a topic for another blog post) and so would never consider using them willingly.</p><p class=\"my-4\">Another advantage of hosting this blog myself on my own domain is that I could post anything I damn well please. I can curse, talk about sexuality, firearms, politics or pornography and there is no algorithm to randomly decide that I am undesirable and bury me under the torrent of content it has to manage. It is highly unlikely that I write about most of these topics with any regularity because they stand far away from my main interests by I could and I like freedom. Freedom is good and you can quote me on that. I am aware that this isn't strictly true because Google and other search engines could still dereference me based on their agendas but I don't plan on relying on their help for trafic probably ever.</p><p class=\"my-4\">One last use I think this blog will have for me is to force clarity into my thoughts. Many people have said and I have noticed too that if you can't articulate a concept you don't really understand it or haven't thought about it long enough. Coupled with my infuriating habit of playing the Devil's advocate wherever I can and mostly against myself I hope writing these posts will help me think better and more thouroughly, something that most people dearly lack.</p>"
}
