{
	"title": "Super 3D Retro",
	"date": "2017-05-12",
	"displayDate": "May 2017",
	"visible": false,
	"original": "super-3d-retro",
	"tags": ["project", "3D", "retro", "abandonned", "tech", "français"],
	"content": "<p class=\"my-4\">Un jour de mai, lors de ma première année <a href=\"blog/2-years-in-ireland\" class=\"a\">en Irlande</a>, j’ai commencé à réfléchir aux systèmes 3D ; pas particulièrement sur la gestion de collision mais sur l’affichage (par des wireframe très simples) des graphiques 3D. Je n’avais aucune idée de comment ajouter efficacement des textures différentes des couleurs plates sur les polygones ni comment gérer la lumière, mais j’avais étudié les mathématiques des vecteurs 3D à l’école et je me souvenais que ce n’était pas si complexe - du moins pas plus que sur les modèles de vecteurs 2D que j’utilisais déjà lorsque je créais des jeux.</p><p class=\"my-4\">Alors, au lieu de partir chercher toutes les informations du sujet sur Internet, j’ai essayé de créer un petit jeu avec des graphiques de wireframe retro 3D à partir de rien. J’étais déjà tellement fan du concept du web que pour le coup j’étais parti à faire tout en JS et l’appliquer sur un canevas.</p><p class=\"my-4\">Comme on peut s’y attendre, ça n’a pas marché à la perfection et j’ai fatalement abandonné mon projet lorsque je me suis rendu compte que pour le faire fonctionner il aurait fallu que je ré-écrive tout depuis le début à cause d’une erreur fondamentale de ma part. En vérité, cela fonctionne proprement sur les objets, mais comme je ne connaissait pas les <a href=\"https://en.wikipedia.org/wiki/Projection_matrix\" target=\"_blank\" class=\"a\">matrices de projections</a> à l’époque, les bords de l’écran sont courbés comme à travers une lentille <a href=\"https://fr.wikipedia.org/wiki/Objectif_fisheye\" target=\"_blank\" class=\"a\">\"fish eye\"</a>.</p><p class=\"my-4\">Néanmoins, mis à part ce problème de caméra, les graphiques 3D très basiques sont en fait assez simples. Cela se corse de manière exponentielle si on a besoin de plus de features (textures, lumières, fondu…) mais j’ai beaucoup appris et m’amuse beaucoup à faire tourner mon propre moteur de rendus. Je pense que j’ai écrit mes propres fonctions mathématiques de vecteurs aussi.</p><p class=\"my-4\">Le prototype est toujours disponible <a href=\"https://terry.gonguet.com/super3dretro\" target=\"_blank\" class=\"a\">here</a>. Le répo Github est <a href=\"https://github.com/terrygonguet/super3DRetro\" target=\"_blank\" class=\"a\">ici</a>.</p><p class=\"my-4 text-base\">Traduit par <a href=\"https://www.deviantart.com/little-marylis\" target=\"_blank\" class=\"a\">Marylis</a>.</p>"
}
