{
	"title": "What is beauty?",
	"date": "2020-07-16",
	"visible": true,
	"tags": [],
	"content": [
		"<blockquote class=\"flex justify-center p-4 m-4\">",
		"  <p class=\"text-xl text-center\">",
		"    Beauty from harmony<br>",
		"    Elegance from restraint<br>",
		"    Require limits",
		"  </p>",
		"</blockquote>",
		"",
		"<p class=\"my-4\">As a programmer and even just as a human being I've been <span class=\"line-through\">obsessed</span> passionate about beautiful and elegant things in code or otherwise. Beautiful things are much easier to look at and elegant design is much easier to work with, but why? Where do they come from? This post explains how I see things and how I try to make things beautiful and elegant. The little poem thing at the start (no it's not a <a href=\"https://en.wikipedia.org/wiki/Haiku\" target=\"_blank\" class=\"a\">Haiku</a>, it just looks kinda like one) kind of happened while I was thinking about these things. I never wrote or cared about poetry before so that was surprising.</p>",
		"",
		"<h2 class=\"font-semibold text-2xl my-4\">Beauty</h2>",
		"<p class=\"my-4\">What do you find beautiful?</p>",
		"<textarea class=\"border bg-bg w-full border-gray-900 resize-none p-2 focus:border-accent-light\" rows=3 placeholder=\"The Grand Canyon\"></textarea>",
		"<p class=\"text-base text-gray-500\">Don't worry nobody will see this unless you share it yourself. I strongly encourage you to think and write a bit about the topic however.</p>",
		"<p class=\"my-4\">Maybe what you thought about has a distinct color like the <a href=\"https://duckduckgo.com/?q=grand+canyon&iar=images&iax=images&ia=images\" target=\"_blank\" class=\"a\">Grand Canyon</a> wich is mostly orange (or <em>ocre</em>). While orange is my favorite color it has nothing beautiful in and of itself, it's just a value (between roughly 585 and 620 nanometres). What makes the Grand Canyon incredible is the mix of the colors, the contrast between the greener rivers and the cliffs, the sheer scale of it and the pristine environment. None of the factors alone contain beauty but together they do. The dress isn't beautiful, it's the way you wear it with jewelry and makeup and everything.</p>",
		"<p class=\"my-4\">But it's not enough to just have a dress, earring and some eye liner, they have to go together <em>in harmony</em>. I think most people put way too much emphasis on individual characteristics rather than appreciating the harmony of the whole: \"I only date tall men\", \"I only read science fiction\" etc... The more complex something is the more important it become for the individual pieces sing in harmony and what is more intricate than a person? This is why even though you may like <a href=\"https://duckduckgo.com/?t=ffcm&q=Natalie+Dormer&ia=images&iax=images\" target=\"_blank\" class=\"a\">Natalie Dormer</a> you probably love your significant other much <em>much</em> more (or your mom for those less lucky). Even though Dormer's aesthetics have broad appeal she cannot compete with the exquisite harmony of a loved one.</p>",
		"<p class=\"my-4\">Another way to look at it is that you don't have to have \"ideal\" conditions to produce something beautiful: your client wants yet another blue-white website, your date is chubbier than you'd like or your kid is <span title=\"It usually stops between 18 and 89\">becoming a communist</span>. These things shouldn't be deal breakers because they are merely the first notes with which the rest of the melody can harmonize. You can make a beautiful and original blue-white website, maybe your date is the funniest person you've ever seen and maybe you can help and support your kid in their efforts to make the world a better place. Beauty is in the whole, in the harmony of the parts.</p>",
		"",
		"<h2 class=\"font-semibold text-2xl my-4\">Elegance</h2>",
		"<p class=\"my-4\">Elegance is so strongly linked to beauty that the two terms are often used interchangeably and although I can see why, I think there are very good reasons they are two different words. As explained above I think beauty comes from the harmony of the parts but elegance is not a given in something beautiful. It has to come from somewhere else, close but separate. If you paid any attention to the introductory poem you might have guessed what I'm going to write next: restraint.</p>",
		"<p class=\"my-4\">I think we can agree that one of these two gardens is more elegant than the other though they are both beautiful in their own way.</p>",
		"",
		"<style>",
		":checked + label {",
		"  border: 2px solid var(--color-accent-light);",
		"}",
		"</style>",
		"",
		"<form class=\"flex flex-col md:flex-row justify-evenly items-stretch my-4 md:h-64\" onsubmit=\"return false\">",
		"  <input type=\"radio\" name=\"garden\" class=\"hidden\" id=\"garden1\" />",
		"  <label for=\"garden1\" class=\"border-2 md:w-1/3 m-4 cursor-pointer\">",
		"    <img src=\"https://residencestyle.com/wp-content/uploads/2018/10/Beautiful-Garden.jpg\" class=\"h-full w-full object-cover\" />",
		"  </label>",
		"  <input type=\"radio\" name=\"garden\" class=\"hidden\" id=\"garden2\" />",
		"  <label for=\"garden2\" class=\"border-2 md:w-1/3 m-4 cursor-pointer\">",
		"    <img src=\"http://2.bp.blogspot.com/-kGP8SQ4Q0Eg/Uy_aUqM4bjI/AAAAAAAAATs/DogYkVSmmi4/s1600/zen-garden-01.jpg\" class=\"h-full w-full object-cover\" />",
		"  </label>",
		"</form>",
		"",
		"<p class=\"my-4\">What's the main difference?</p>",
		"<input type=\"text\" class=\"bg-bg p-2 w-full border border-gray-900 focus:border-accent-light\" placeholder=\"Colors maybe?\" />",
		"<p class=\"my-4\">While many things are different between the two gardens I think the underlying theme is restraint. The Zen garden has basically three colors (brown, beige and green) while the flower garden has too many to count at a glance. Plants are grown all over the place in big sprawling bushes on the first picture where everything is carefully trimmed and kept sparse on the second. I personally much prefer the zen garden for the quiet serenity and thoughtful elegance it exudes. Of course I appreciate a good flowered garden like any human but it feels much noisier, unorganised; an overload of the senses.<p>",
		"<p class=\"my-4\">I'm not saying the first garden is completely devoid of elegance, everything is on a spectrum and elegance doesn't <em>only</em> come from restraint but this is the way I view things for now.</p>",
		"",
		"<h2 class=\"font-semibold text-2xl my-4\">Limits</h2>",
		"<p class=\"my-4\">Anyone who's ever tried to create anything has at some point faced the blank page and it's <a href=\"https://en.wikipedia.org/wiki/Writer's_block\" target=\"_blank\" class=\"a\">accompanying horror</a>. A common way to combat this is to impose <a href=\"https://en.wikipedia.org/wiki/A_Void\" target=\"_blank\" class=\"a\">more or less restrictive limits</a> on the kind of work you will produce. I've seen many people discuss this aspect of creation more competently than I ever could so I'll be brief. A piece of art only has meaning through its intrinsic limits: a garden actually has to be a garden first before it can be or say anything else; a song has to have a style, instruments, a meter otherwise it's just incoherent noise. Of course everything can be deconstructed to examine its meaning and many musicians choose to not have a fixed meter or something else but those pieces shine by their transgression of the model.</p>",
		"<p class=\"my-4\">Just like you can't please everyone I think limits are required in anything you can create. Something without limits or structure is just white noise, and while every piece of information is <a href=\"https://www.angio.net/pi/\" target=\"_blank\" class=\"a\">contained in an infinitely random sequence</a> it can never have any meaning.</p>"
	]
}
